{
"60" : "Yes, some attraction here. You both operate quite differently. Sometimes circumstances bring you together. Your long term chances for a permanent relationship are weak and will eventually break the bond that you have. Enjoy what you do have for the time being.",
"61" : "Yes, some attraction  between you. Do not count on a long term relationship as there are too many differences between you to make that possible. You can best enjoy the moment as eventually the differences will make your bond snap.",
"62" : "A sure attraction between you. There will be differences in how you both see life. You may think you could have a long term relationship but you are only kidding yourself. Hard to co-ordinate smoothly on many different levels. Enjoy whatever time you have.",
"63" : "A definite attraction between you. There will be differences between you that you may brush aside for harmony’s sake. These differences will come back to haunt you eventually. Difficult to form a truly long term relationship. Things will come up that will make it hard to smooth over difficulties.",
"64" : "A definite attraction and feelings of a positive attitude towards one another early on. Differences will creep up as time goes on, making you realize that you do not see things the same. You may desire a long term relationship but your basic differences will make that very difficult to attain.",
"65" : "A positive attraction between you. You will try to overlook differences, but the harder you try , the more you see the differences. You may try to have a long term relationship, but you will both feel it requires a lot of effort.  You may try because of the good things that are there, but regret the time and effort it requires.",
"66" : "A positive and sure attraction between you. You will try to make this work, but will have some differences to overcome. When things are going well, the two of you will try to overlook differences. When things are difficult, that brings out the worst in your attitudes towards one another. Enjoy what you can as there is much to like.",
"67" : "A definite attraction and good feelings towards one another. There is a desire to want a long term relationship, but is easier said than done. The differences are there, they are just swept under the rug. Then there comes a point where that cannot be done any longer. Sometimes it is a make or break moment for you.",
"68" : "Strong definite attraction and positive feelings that go with it.  You  may think you’ve found the right person. On closer inspection you will see that you are both quite different and may not agree on many things. It will require effort to overcome these things but you could be happier for it.",
"69" : "Positive strong attraction and the elated feelings that go with it.  You are both aware of your differences and more often than not try to overcome them. You both understand that not everything can be perfect and will try to weather your temporary storms. On occasion you will not be able to. Then your relationship can continue or face extinction. The cosmic choice is yours.",
"70" : "This is what I call the “Goldilocks” zone.  Oh yes you are obviously attracted to each other. You have a lot of potential in this relationship. Yes a few differences here and there, but you sense there is something good here and worth pursuing for your better selves.",
"71" : "A bonafide strong attraction. You can see the differences but it dosen’t seem to matter that much. You feel you are destined to be together and will cross those bridges when you come to them. You have potential for the long term and feel you just need to pursue it for your happiness.",
"72" : "Strong obvious attraction. You both understand the differences between you, but no matter what, you both feel your potential together. You have the ability for long term happiness. There will be a few bumps along the way. But you will try not to let that separate you!",
"73" : "Strong positive attraction. More compatibility than not. There are a few differences that you both can see, but it does not take away the magic between you. You will try to achieve a lot with this relationship as you both see the potential of long term happiness.",
"74" : "Good Prospect-Strong attraction. Your chances are better than average for a lasting relationship with this person. The planets indicate there are many areas of compatibility which can develop into a strong bond!",
"75" : "Very good prospect-intense attraction. Chances are quite good to form a lasting relationship with this person. There are differences, but you are able to navigate them with ease. This is definitely worth pursuing!",
"76" : "Excellent prospect-strong attraction. Chances are very good that you will be able to form a harmonious long term relationship with this person.  Your basic compatibility will smooth over differences to bring happiness to both of you. Go for it!",
"77" : "Strong prospect and intense attraction as well. Give this a complete chance as it will be worth it. Your compatibility is high and your chances for happiness is good. You both accept each others weaknesses and are able to always find common ground with one another.",
"78" : "Strong excellent prospect with an intense attraction. You automatically feel you are a couple whether you are or not . Strong feelings that this may be the one. Your chances for long term happiness are very good. You are capable of overcoming many things as the desire to be together is powerful!",
"79" : "Excellent potential with strong positive attraction. You can become a stable happy couple as you will always overcome any slight differences that you have. The world sees you as a great example of couple’s harmony. Powerful compatibility that has the chance for a long term relationship.",
"80" : "Terrific potential and powerful attraction. There is no doubt about this one. Strong compatibility and overall smooth harmony. You see the world in a similar fashion and feel better together than apart. Your future is a long term relationship.",
"81" : "Strong attraction and lots of potential. Comfortable feelings when together. Sweet Harmony! No matter what your obstacles are, the two of you will overcome them. You can easily have a long term relationship, as things seem to be better together than apart.",
"82" : "Intense strong attraction loaded with potential. You both feel how compatible you are. You know automatically that you can have a long term relationship. You can create things together as blending your selves for a higher purpose seems like a very good idea!",
"83" : "Intense powerful attraction with excellent potential. If you are together, others see you both as one unit. Things go smoothly and you can easily get thru problems, no matter what they are. A long term relationship seems to be the only logical conclusion. You are meant for happiness together!",
"84" : "Strong attraction, intense reaction to each other with an intuition that this could be a permanent. Any difficulty will be solved together smoothly with as little fuss as possible. You feel instantly happy and relaxed when you are together and will want to spend as much time as possible in each others company!",
"85" : "Powerful attraction and a feeling of peace and wonder in each others company. You know intuitively that you should be together. You will make the effort necessary to bond with one another as it will be very difficult to be apart. You may feel that you could be “soul mates” and should be together no matter what!",
"86" : "Spiritual, emotional and physical attraction that could almost be overwhelming. The strength of your attraction can turn your life upside down. You know intuitively that this is a very important relationship and it cannot be ignored. Being together seems the only way to go as your feelings for each other takes precedence over everything!",
"87" : "Powerful attraction and a feeling of great inspiration with one another. There is an emotional high that is always there in each others company. You are able to block out the rest of the world and be insanely happy in each others company. You know that this relationahip is meant to last a lifetime.",
"88" : "Intense and powerful attraction with strong feelings that create an instant togetherness between you. You feel that this could be your “soul mate”. Problems that occur seem to fade so quickly that you stay in an emotional high almost all the time just having that person near you, no matter where you are.",
"89" : "Spiritual transformation thru your intense attraction and belief that this person is a part of you. This could be your soul mate! This definitely has the potential of a lifetime of happiness! This is a rare combination that should not be ignored under any circumstances as you have a cosmic reason for being together.",
"90" : "Are you twins?? A strong attraction in the beginning that make you feel you are almost the same soul. An intense and strong feeling you were born to be together in this lifetime. All problems are solved with ease because you both make the same amount of effort in solving them. Great happiness for the both of you.",
"91" : "You could be twins. You can finish each others sentences and always act as a unit. You have always had a strong spiritual, emotional and physical attraction that can create a lifetime of happiness. You will always find away to be together. It is your destiny.",
"92" : "So similar you could be twins! Your spiritual, emotional and physical attraction is a once in a lifetime event. You know that being together is very important for your well-being and overall happiness. There is a cosmic reason for your togetherness and happiness.",
"93" : "Great similarity that you feel like twins. It is rare to have such a high percentage of compatibility. Soul mates comes to mind. Your emotional, spiritual and physical attraction is so strong that being around the two of you feels unusual for other people to see and feel and inspires them to want to be like you.",
"94" : "You must be twins! Your compatibility, (spiritual, emotional and physical) is so striking that other people notice the two of you. You have a destiny to fulfill and you create inspiration wherever the two of you go. Your compatibility score is extremely high and you are blessed with complete happiness.",
"95" : "Yes you are like twins! It is so rare to have such a high compatibility with your spiritual, emotional and physical selves that you are a fine example of soul mates. You will want to be together always. If circumstances prevent that. The both of you will figure out a way to be together whatever it takes to do so."
}